__SAMPLE MIDTERM 1__

Full name: Nguyễn Thị Minh Ngọc
<br>
Student ID: 11219280
<br>
Class: DSEB 63

In [1]:
import pandas as pd
import numpy as np
import regex as re

# I. Demographic dataset

1. Read demographic.csv into a DataFrame name demo

In [2]:
demo = pd.read_csv("data/demographic.csv")
demo

    age gender                    email address
0  18.0      M                      NaN      HN
1  23.0      F                      NaN      HP
2   NaN      M            abc@gmail.com      BG
3  40.0    NaN  qgiang.nguyen@gmail.com      BN
4  67.0      F                      NaN   TPHCM
5   NaN    NaN         abc@yahoo.com.vn      BD

2. The email attribute contains 'abc@gmail.com' values that indicate values are missing, but they aren't represented as NaN. Replace them with NaN value

In [3]:
demo = demo.replace("abc@", np.nan, regex=True)
demo

    age gender                    email address
0  18.0      M                      NaN      HN
1  23.0      F                      NaN      HP
2   NaN      M                      NaN      BG
3  40.0    NaN  qgiang.nguyen@gmail.com      BN
4  67.0      F                      NaN   TPHCM
5   NaN    NaN                      NaN      BD

3. Calculate the total number of missing values for each column

In [4]:
demo.isnull().sum()

age        2
gender     2
email      5
address    0
dtype: int64

4. Add a new column named "Total Null". It should be the total number of nan values of each row.

In [5]:
demo["Total Null"] = demo.apply(lambda x: x.isnull().sum(), axis=1)
demo

    age gender                    email address  Total Null
0  18.0      M                      NaN      HN           1
1  23.0      F                      NaN      HP           1
2   NaN      M                      NaN      BG           2
3  40.0    NaN  qgiang.nguyen@gmail.com      BN           1
4  67.0      F                      NaN   TPHCM           1
5   NaN    NaN                      NaN      BD           3

5. Drop columns that contain more than 80% missing value using the dropna function

In [6]:
demo = demo.dropna(axis=0, thresh=demo.shape[1]*0.2)
demo

    age gender                    email address  Total Null
0  18.0      M                      NaN      HN           1
1  23.0      F                      NaN      HP           1
2   NaN      M                      NaN      BG           2
3  40.0    NaN  qgiang.nguyen@gmail.com      BN           1
4  67.0      F                      NaN   TPHCM           1
5   NaN    NaN                      NaN      BD           3

6. Drop rows that contain more than two missing values using the dropna function

In [7]:
demo = demo.dropna(axis=0, thresh=demo.shape[1]-2)
demo

    age gender                    email address  Total Null
0  18.0      M                      NaN      HN           1
1  23.0      F                      NaN      HP           1
2   NaN      M                      NaN      BG           2
3  40.0    NaN  qgiang.nguyen@gmail.com      BN           1
4  67.0      F                      NaN   TPHCM           1

7. Reread this dataset. This time, we will fill the missing values with other values instead of dropping them.
- Fill the missing value of the age attribute by the mean value of this attribute

In [8]:
demo1 = pd.read_csv("data/demographic.csv")
demo1

    age gender                    email address
0  18.0      M                      NaN      HN
1  23.0      F                      NaN      HP
2   NaN      M            abc@gmail.com      BG
3  40.0    NaN  qgiang.nguyen@gmail.com      BN
4  67.0      F                      NaN   TPHCM
5   NaN    NaN         abc@yahoo.com.vn      BD

In [9]:
demo1["age"].fillna(demo1["age"].mean(), inplace=True)
demo1

C:\Users\minhn\AppData\Local\Temp\ipykernel_14156\3428459200.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  demo1["age"].fillna(demo1["age"].mean(), inplace=True)

    age gender                    email address
0  18.0      M                      NaN      HN
1  23.0      F                      NaN      HP
2  37.0      M            abc@gmail.com      BG
3  40.0    NaN  qgiang.nguyen@gmail.com      BN
4  67.0      F                      NaN   TPHCM
5  37.0    NaN         abc@yahoo.com.vn      BD

- Fill the missing value of the gender attribute by the most Frequent Occurring. In the case of having more than one with the highest frequency occurring, randomly choose one between them to fill the missing value

In [10]:
# value with the highest frequency occurring
demo1['gender'].mode()

0    F
1    M
Name: gender, dtype: object

In [11]:
demo1['gender'].fillna(np.random.choice(demo1['gender'].mode().values), inplace=True)
demo1

C:\Users\minhn\AppData\Local\Temp\ipykernel_14156\3197308182.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  demo1['gender'].fillna(np.random.choice(demo1['gender'].mode().values), inplace=True)

    age gender                    email address
0  18.0      M                      NaN      HN
1  23.0      F                      NaN      HP
2  37.0      M            abc@gmail.com      BG
3  40.0      F  qgiang.nguyen@gmail.com      BN
4  67.0      F                      NaN   TPHCM
5  37.0      F         abc@yahoo.com.vn      BD

# II. Revenue dataset

In [12]:
reve = pd.read_csv("data/revenue.csv")
reve

  CustomerID  Revenue        date
0      R1001       30  2020-12-01
1      W1001     2000  2021-05-01
2      W1001     2200  2021-05-01
3      R1002      150  2021-08-01
4      R1003      270  2020-09-01
5      R1004       50  2021-12-01
6      R1001      100  2021-04-01
7      W1002     5000  2021-09-01

1. For typing errors, in this dataset, we see that some customers' revenue appears more than once for a specific month. We need to delete one and keep the row with a larger income.

In [13]:
reve = reve.groupby(['CustomerID', 'date']).max('Revenue').reset_index()
reve = reve[['CustomerID', 'Revenue', 'date']]
reve

  CustomerID  Revenue        date
0      R1001       30  2020-12-01
1      R1001      100  2021-04-01
2      R1002      150  2021-08-01
3      R1003      270  2020-09-01
4      R1004       50  2021-12-01
5      W1001     2200  2021-05-01
6      W1002     5000  2021-09-01

2. In this dataset, we would like to know the latest revenue created by each customer and the time. We would remove rows that contain a CustomerID already listed earlier. Do it using the drop_duplicates method.

In [14]:
# sort the dataframe by CustomerID and date respectively
reve = reve.sort_values(by=['CustomerID', 'date'])
reve

  CustomerID  Revenue        date
0      R1001       30  2020-12-01
1      R1001      100  2021-04-01
2      R1002      150  2021-08-01
3      R1003      270  2020-09-01
4      R1004       50  2021-12-01
5      W1001     2200  2021-05-01
6      W1002     5000  2021-09-01

In [15]:
reve = reve.drop_duplicates("CustomerID", keep='last', ignore_index=True)
reve

  CustomerID  Revenue        date
0      R1001      100  2021-04-01
1      R1002      150  2021-08-01
2      R1003      270  2020-09-01
3      R1004       50  2021-12-01
4      W1001     2200  2021-05-01
5      W1002     5000  2021-09-01

# III. Apps dataset

In [16]:
apps = pd.read_csv("data/apps.csv", encoding="latin")
apps

  app name    price
0   Latlux   £49.70
1     Span  $12.22
2  Bitwolf   $17,30
3  Sonsing   £10.71
4  Zontrax   ¥48.41

1. Create a new column named currency whose values are the first character of the price column

In [17]:
apps["price"] = apps['price'].str.strip()
apps['currency'] = apps['price'].str.extract("(^\S)")
apps

  app name   price currency
0   Latlux  £49.70        £
1     Span  $12.22        $
2  Bitwolf  $17,30        $
3  Sonsing  £10.71        £
4  Zontrax  ¥48.41        ¥

2. Transform the price column into floating-point number by:
* Deleting the currency characters
* Replacing commas by dots

In [18]:
apps['price'] = apps['price'].str.replace("^\D", "", regex=True)
apps['price'] = apps['price'].str.replace(",", ".", regex=False)
apps

  app name  price currency
0   Latlux  49.70        £
1     Span  12.22        $
2  Bitwolf  17.30        $
3  Sonsing  10.71        £
4  Zontrax  48.41        ¥

* Casting the column to float

In [19]:
apps["price"] = apps["price"].astype("float")
apps["price"].dtype

dtype('float64')

3. Make currency column a categorical

In [20]:
apps['currency'] = pd.Categorical(apps['currency'])
apps['currency'].dtype

CategoricalDtype(categories=['$', '£', '¥'], ordered=False, categories_dtype=object)

# IV. People dataset

In [21]:
people = pd.read_csv("data/people.csv")
people

       name  phone number
0   Pernell     389440066
1    Milena   84914208888
2   Terrijo     931999666
3    Carmon     974768936
4  Cornelia   84346663333

In [22]:
people['phone number'] = people['phone number'].astype('str')
people['phone number'].apply(lambda x: '0' + x[-9::])

0    0389440066
1    0914208888
2    0931999666
3    0974768936
4    0346663333
Name: phone number, dtype: object

# V. Birthday dataset

1. Read the birthdays.csv into a DataFrame named birthdays

In [23]:
birthdays = pd.read_csv("data/birthdays.csv")
birthdays

     name adress    birthday
0      An     HN   28.3.2019
1    Hang     QN   5/12/2020
2     Nga     BT   25-Sep-19
3     Anh     TB    3-Jan-19
4  Phuong     ND  03.08.2019

2. Use vectorized string methods to extract the year

In [24]:
birthdays['year'] = birthdays['birthday'].str.extract("(\d+$)")
birthdays['year'] = birthdays['year'].apply(lambda x: '20' + x[-2::])
birthdays

     name adress    birthday  year
0      An     HN   28.3.2019  2019
1    Hang     QN   5/12/2020  2020
2     Nga     BT   25-Sep-19  2019
3     Anh     TB    3-Jan-19  2019
4  Phuong     ND  03.08.2019  2019

3. User the Series.astype() method to convert the type to a float

In [25]:
birthdays['year'] = birthdays['year'].astype("float")
birthdays['year'].dtype

dtype('float64')

# VI. URL dataset

1. Read the urls.csv into a DataFrame named urls

In [26]:
urls = pd.read_csv("data/urls.csv")
urls

             id                                                url
0  accc1111fa49  https://www.kaggle.com/datasets/teseract/urlda...
1  48ee0ff1ce97                              https://vesta-nf.com/
2  006ff702f8ea                     http://wordpress.com/amet.html
3   7fb76495700                  http://qq.com/lacus/morbi/sem.jpg
4    a8484937dc                       https://www.vndirect.com.vn/

2. Add a secure Boolean column. It should have the value True if the URL starts with HTTPs and False otherwise

In [27]:
urls['secure'] = urls['url'].str.contains("https")
urls

             id                                                url  secure
0  accc1111fa49  https://www.kaggle.com/datasets/teseract/urlda...    True
1  48ee0ff1ce97                              https://vesta-nf.com/    True
2  006ff702f8ea                     http://wordpress.com/amet.html   False
3   7fb76495700                  http://qq.com/lacus/morbi/sem.jpg   False
4    a8484937dc                       https://www.vndirect.com.vn/    True

3. Add an extension column. It should have the URL extension (all characters after the last in the URL). In our case: jpg, html

In [28]:
urls['extension'] = urls['url'].str.extract('\.(\w+$)')
urls

,id,url,secure,extension
0,accc1111fa49,https://www.kaggle.com/datasets/teseract/urlda...,True,NaN
1,48ee0ff1ce97,https://vesta-nf.com/,True,NaN
2,006ff702f8ea,http://wordpress.com/amet.html,False,html
3,7fb76495700,http://qq.com/lacus/morbi/sem.jpg,False,jpg
4,a8484937dc,https://www.vndirect.com.vn/,True,NaN